<img src="titanic.jpg" height=200 width=400/>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
df['Nationality'] = 'saudi'

In [5]:
df['Age'] = df['Age']-1

In [6]:
df = df.drop(columns='PassengerId' )

In [28]:
x = pd.isnull(df['Age'])
df[x].count()

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
Ticket      0
Fare        0
Cabin       0
dtype: int64

In [7]:
median_age = df['Age'].median()

In [8]:
df['Age'].fillna(median_age)

0      21.0
1      37.0
2      25.0
3      34.0
4      34.0
       ...
886    26.0
887    18.0
888    27.0
889    25.0
890    31.0
Name: Age, Length: 891, dtype: float64

In [9]:
df.drop_duplicates(keep='first', inplace=True)

In [10]:
df.loc[df['Age'] > 70, 'Survived'] = 1

In [11]:
df.drop_duplicates(subset='email',keep='last', inplace=True)

KeyError: Index(['email'], dtype='object')

In [12]:
df.groupby('Survived').mean()

            Pclass        Age     SibSp     Parch       Fare
Survived
0         2.531022  29.523641  0.554745  0.330292  22.144060
1         1.953353  27.500584  0.472303  0.463557  48.276981

In [58]:
df.groupby('Survived')['Fare'].mean()

Survived
0    22.117887
1    48.395408
Name: Fare, dtype: float64

In [59]:
df.groupby('Survived')['Age'].sum()

Survived
0    12985.50
1     8219.67
Name: Age, dtype: float64

In [60]:
df.groupby('Survived')['Age'].count()

Survived
0    424
1    290
Name: Age, dtype: int64

In [61]:
df.to_excel("output.xlsx")

In [62]:
! ls

Presentation.pptx                    output.xlsx
Presentation1.pptx                   python.docx
Untitled.ipynb                       titanic Jabyeter.ipynb
Untitled1.ipynb                      titanic.csv
Untitled2.ipynb                      titanic.jpg
investigate-a-dataset-template.ipynb titanic.xlsx